/*
	문제 1. 10진수 8부터 20까지 2진수(8비트)와 16진수로 표기해보기.

	10진수	    2진수			16진수
		 8		0000 1000	    0x08
		 9		0000 1001 	    0x09
		10		0000 1010	    0x0A
		11		0000 1011	    0x0B
		12		0000 1100	    0x0C
		13		0000 1101	    0x0D
		14		0000 1110	    0x0E
		15		0000 1111	    0x0F
		16		0001 0000	    0x10
		17		0001 0001	    0x11
		18		0001 0010	    0x12
		19		0001 0011	    0x13
		20		0001 0100	    0x14

	문제 2. 10진수 5부터 18까지 8진수로 표기해보기

	10진수		8진수
	     5		  005
	     6		  006
	     7		  007
	     8	      010
	     9	      011
	    10	      012
	    11	      013
	    12	      014
	    13	      015
	    14	      016
	    15	      017
	    16	      020
	    17	      021
	    18	      022

	문제 3. 각각 2진수는 10진수로 얼마인가?

	  0000 0001		    1
	  0000 0010		    2
	  0000 0100		    4
	  0000 1000		    8
	  0001 0000		   16
	  0010 0000		   32
	  0100 0000		   64
	  1000 0000		  128

	문제 4. 다음 signed 4비트는 10진수로 얼마인가?
	1001 -> 0110 -> 0111 => -7
	1010 -> 0101 -> 0110 => -6

	문제 5. 값을 입력 받고 부호 바꿔 출력해보기 ( 코딩 문제, 단 -1 곱하지 않는 조건으로)
	

	문제 6. 3*8/4의 식을 산술 연산 없이 표현해보기.

	// (3<<3)>>2
	
*/

#include <iostream> 
using namespace std;

int SignChange(int _iNum) // 문제 5번 함수.
{
	int iNum = ~_iNum;

	iNum += 1;
	return iNum;
}




void main()
{
	int a = 0;
	
	cin >> a;
	
	cout << SignChange(a) << endl;

	return;
}