#include <iostream>
#include <list>

using namespace std;

void main()
{
	// ##5. sort 멤버함수
	list<int> lst{ 5,2,4,3,1 }; // 유니폼 초기화 가능.

	// lst.sort(); // 기본 오름차순 정렬.
	lst.sort(greater<int>()); // 조건자를 이용한 내림차순.
	lst.sort(less<int>());	  // 조건자를 이용한 오름차순.

	for (int element : lst)
		cout << element << endl;


	// ##6. vector 와 list
	/*
						|		Vector			|			list			|
	 -------------------------------------------------------------------------
	 메모리 방식		|    배열기반(연속된)	|	 노드기반(비연속적인    |
	 -------------------------------------------------------------------------
	 반복자				|    임의접근 + 양방향	|	 양방향 반복자		    |
	 -------------------------------------------------------------------------
	 장점				|    탐색에 유리		|	 빈번한 삽입 삭제 유리  |
	 -------------------------------------------------------------------------
	 단점				| 빈번한 삽입 삭제 불리	|	 탐색에 불리		    |
	 -------------------------------------------------------------------------
	 sort				|  <algorithm>에서 제공	|	 멤버함수로 제공	    |
	 -------------------------------------------------------------------------
	 공통				| 표준 시퀀스 컨테이너 (선형적인 구조)				|
	 -------------------------------------------------------------------------



	*/


	return;
}